# RailingSystemSegmentVGrid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..RailingSystemSegmentVGrid Property
GroupTypeId Class See Also
---
V Grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemSegmentVGrid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemSegmentVGrid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemSegmentVGrid {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace